package ru.geekbrains.java1.lesson1.hw1;

public class HW1_4 {
    //Написать метод, которому в качестве параметра передается строка, обозначающая имя,
    // метод должен вернуть приветственное сообщение «Привет, переданное_имя!»;
    // Вывести приветствие в консоль.
    public static void main(String[] args){
        String i;
        i=("Алена");
            System.out.println("Привет,"+" "+i+"!");
        }
    }

